Revit 2026 API

# ExternalResourceServerUtils Class

---

Contains utilities related to external resource server.

SystemObject Autodesk.Revit.DBExternalResourceServerUtils

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ExternalResourceServerUtils
```
```vb
Public NotInheritable Class ExternalResourceServerUtils
```
```cpp
public ref class ExternalResourceServerUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ExternalResourceServerUtils = class end
```

The ExternalResourceServerUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidShortName | Checks whether the name is a valid short name for the external resource server. |
|  | ServerSupportsAssemblyCodeData | Checks that the server referenced by the given ExternalResourceReference supports AssemblyCodeData. |
|  | ServerSupportsCADLinks | Checks that the server referenced by the given ExternalResourceReference supports CAD links. |
|  | ServerSupportsIFCLinks | Checks that the server referenced by the given ExternalResourceReference supports IFC links. |
|  | ServerSupportsKeynotes | Checks that the server referenced by the given ExternalResourceReference supports KeynoteTable data. |
|  | ServerSupportsRevitLinks | Checks that the server referenced by the given ExternalResourceReference supports Revit links. |

#### Reference

Autodesk.Revit.DB Namespace